app/views/devices/_form.html.erb

SELECT "cases".* FROM "cases"
SELECT "cases".* FROM "cases" INNER JOIN "devicecases" ON "cases"."id" = "devicecases"."case_id" WHERE "devicecases"."device_id" = $1  [["device_id", 3]]
---
  <%= f.label :cases, :class => "col-sm-2 control-label" %>
  <% cases_list = Case.all.map{|c| [c.name+" "+c.color+": "+c.product_type, c.id ]} %>
   <div class="col-sm-10"><%= f.select :cases, options_for_select( cases_list, @device.cases.to_a.map{ |c| c.id}),{},{ :class => "form-control", :multiple => true} %></div>