app/views/devices/index.html.erb

                <p style="white-space:nowrap; width:490px; overflow:hidden; text-overflow: ellipsis;" class="p-no-margin">
                  <%= device.cases.to_a.map{ |x| x.name + " " + x.color + ": " + x.product_type }.join(', ') %></td>
---
SELECT "cases".* FROM "cases" INNER JOIN "devicecases" ON "cases"."id" = "devicecases"."case_id" WHERE "devicecases"."device_id" = $1  [["device_id", 1]]