app/views/devices/show.html.erb

						<td width="10">:</td>
						<td><%= @device.cases.to_a.map{ |x| x.name + " " + x.color + ": " + x.product_type }.join(', ') %></td>
---
SELECT "cases".* FROM "cases" INNER JOIN "devicecases" ON "cases"."id" = "devicecases"."case_id" WHERE "devicecases"."device_id" = $1  [["device_id", 3]]