app/views/cases/_form.html.erb

              <div class="multiselect">
              <% checked_devices = @case.devices.to_a.map{ |d| d.id} %>
---
SELECT "devices".* FROM "devices" INNER JOIN "devicecases" ON "devices"."id" = "devicecases"."device_id" WHERE "devicecases"."case_id" = $1  [["case_id", 13]]