app/views/cases/index.json.jbuilder


  json.devices(case_.devices.to_a) do |d|
---
SELECT "devices".* FROM "devices" INNER JOIN "devicecases" ON "devices"."id" = "devicecases"."device_id" WHERE "devicecases"."case_id" = $1  [["case_id", 15]]