app/views/cases/index.html.erb

              <td style="white-space:nowrap;">
              <p style="white-space:nowrap; width:210px; overflow:hidden; text-overflow: ellipsis;" class="p-no-margin"><%= f.devices.to_a.map(&:full_name).join(', ') %></p>
---
SELECT "devices".* FROM "devices" INNER JOIN "devicecases" ON "devices"."id" = "devicecases"."device_id" WHERE "devicecases"."case_id" = $1  [["case_id", 1]]