app/views/cases/new.html.erb

              <div class="multiselect">
                <% checked_devices = @case.devices.to_a.map{ |d| d.id} %>
---
SELECT "devices".* FROM "devices"