app/views/cases/show.html.erb

					<td width="10">:</td>
					<td><%= @case.devices.to_a.map(&:full_name).join(', ') %></td>
---
SELECT "devices".* FROM "devices" INNER JOIN "devicecases" ON "devices"."id" = "devicecases"."device_id" WHERE "devicecases"."case_id" = $1  [[nil, 2]]