app/controllers/cases_controller.rb

SELECT "cases".* FROM "cases"
---
  def index
    @cases = Case.all

INSERT INTO "cases" ("color", "description", "finishing", "material", "name", "picture", "product_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["color", "2"], ["description", "2"], ["finishing", "2"], ["material", "2"], ["name", "2"], ["picture", "Screen_Shot_2013-11-11_at_21.23.14.png"], ["product_type", "2"]]
SELECT "devices".* FROM "devices"
INSERT INTO "devicecases" ("case_id", "device_id") VALUES ($1, $2)  [["case_id", 12], ["device_id", 1]]
INSERT INTO "devices" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Sat, 09 Nov 2013 20:50:50 UTC +00:00], ["updated_at", Sat, 09 Nov 2013 20:50:50 UTC +00:00]]
---
  def create
    if !user_signed_in?
      flash[:alert] = "You need to sign in or sign up before continuing."
      redirect_to action: "index"
    end
    @case = Case.new(case_params)
      if params[:case][:devices] != [""]
        if @case.save
          params[:case][:finishings].each do |finishing|
            finishingcase = Finishingcase.new(:finishing_id => finishing, :case_id => @case.id)
            if finishingcase.valid?
              finishingcase.save
            else
              p finishingcase.errors
            end
          end

          params[:case][:devices].each do |devices|
            devicecases = Devicecase.new(:device_id => devices, :case_id => @case.id)
            if devicecases.valid?
              devicecases.save

DELETE FROM "devicecases" WHERE "devicecases"."case_id" = 15
INSERT INTO "devicecases" ("case_id", "device_id") VALUES ($1, $2)  [["case_id", 15], ["device_id", 4]]
---
  def update
    if !user_signed_in?
      flash[:alert] = "You need to sign in or sign up before continuing."
      redirect_to action: "index"
    end
      if @case.update(case_params)
        Devicecase.where(:case_id => @case.id).delete_all
        Finishingcase.where(:case_id => @case.id).delete_all
        params[:case][:finishings].each do |finishing|
          finishingcase = Finishingcase.new(:finishing_id => finishing, :case_id => @case.id)
          if finishingcase.valid?
            finishingcase.save
          else
            p finishingcase.errors
          end
        end

        params[:case][:devices].each do |devices|
          devicecases = Devicecase.new(:device_id => devices, :case_id => @case.id)
          if devicecases.valid?
            devicecases.save

DELETE FROM "cases" WHERE "cases"."id" = $1  [["id", 1]]
DELETE FROM "devicecases" WHERE "devicecases"."case_id" = 2
---
  def destroy
    if !user_signed_in?
      flash[:alert] = "You need to sign in or sign up before continuing."
      redirect_to action: "index"
    else
      @case.destroy
      Devicecase.where(:case_id => @case.id).delete_all

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT 1  [["id", "add"]]
---
    def set_case
      @case = Case.find(params[:id])