app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices"
---
  def index
    @devices = Device.all

INSERT INTO "devices" ("brand", "created_at", "full_name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["brand", "Samsung"], ["created_at", Sat, 09 Nov 2013 14:16:34 UTC +00:00], ["full_name", "Samsung S4"], ["updated_at", Sat, 09 Nov 2013 14:16:34 UTC +00:00]]
---
  def create
    user_signed_in?
      @device = Device.new(device_params)
      if @device.save

DELETE FROM "devicecases" WHERE "devicecases"."device_id" = 6
INSERT INTO "devicecases" ("case_id", "device_id") VALUES ($1, $2)  [["case_id", 15], ["device_id", 6]]
---
  def update
    user_signed_in?
      if @device.update(device_params)
        Devicecase.where(:device_id => @device.id).delete_all
        params[:device][:cases].each do |cases_id|
          devicecases = Devicecase.new(:device_id => @device.id, :case_id => cases_id)
          if devicecases.valid?
            devicecases.save

DELETE FROM "devices" WHERE "devices"."id" = $1  [["id", 1]]
DELETE FROM "devicecases" WHERE "devicecases"."device_id" = 5
---
  def destroy
    user_signed_in?
    @device.destroy
    Devicecase.where(:device_id => @device.id).delete_all

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT 1  [["id", "3"]]
---
    def set_device
      @device = Device.find(params[:id])